app/views/trains/_form.html.erb

      <%= form.label :current_station,'Текущая станция' %>
      <%= form.collection_select :current_station_id, RailwayStation.all, :id, :title %>
---
SELECT "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."current_station_id" = ?  [["current_station_id", 3]]