app/controllers/railway_stations_controller.rb

  def index
    @railway_stations = RailwayStation.all
---
SELECT "railway_stations".* FROM "railway_stations"

  def create
    @railway_station = RailwayStation.new(railway_station_params)

    respond_to do |format|
      if @railway_station.save
---
INSERT INTO "railway_stations" ("title", "year_foundation", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Fadeeva"], ["year_foundation", 1983], ["created_at", "2022-05-07 06:56:06.581123"], ["updated_at", "2022-05-07 06:56:06.581123"]]

  def destroy
    @railway_station.destroy
---
DELETE FROM "railway_stations" WHERE "railway_stations"."id" = ?  [["id", 4]]

    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])
---
SELECT "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]