app/controllers/routes_controller.rb

INSERT INTO "routes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test name"], ["created_at", "2022-05-21 13:49:24.991161"], ["updated_at", "2022-05-21 13:49:24.991161"]]
---
  def create
    @route = Route.new(route_params)
    if @route.save

UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "тест на апдейт"], ["updated_at", "2022-05-21 13:50:54.014187"], ["id", 7]]
---
  def update
    if @route.update(route_params)

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 5]]
---
  def destroy
    @route.destroy