app/controllers/searches_controller.rb

  def show
    @stations = RailwayStation.all
---
SELECT "railway_stations".* FROM "railway_stations"