app/controllers/tickets_controller.rb

  def create
    @ticket = current_user.tickets.new
    if @ticket.save
---
INSERT INTO "tickets" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2022-06-04 14:32:18.149412"], ["updated_at", "2022-06-04 14:32:18.149412"]]