app/controllers/trains_controller.rb

    def create
      @train = Train.new(train_params)

      if @train.save
---
INSERT INTO "trains" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", "32"], ["created_at", "2022-05-08 10:14:48.529186"], ["updated_at", "2022-05-08 10:14:48.529186"]]

    def update
      if @train.update(train_params)
---
UPDATE "trains" SET "updated_at" = ?, "current_station_id" = ? WHERE "trains"."id" = ?  [["updated_at", "2022-05-14 15:12:17.957059"], ["current_station_id", 1], ["id", 7]]

    def destroy
      @train.destroy
---
DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 6]]

    def set_train
      @train = Train.find(params[:id])
---
SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]